# PrevSObj

## Description
Function PrevSObj returns the previous selected object in the list preceding the referenced object.

```pascal
FUNCTION PrevSObj(h : HANDLE): HANDLE;
```

```python
def vs.PrevSObj(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling